Revit 2027 API
FootPrintRoof.GetProfiles Method
Retrieve all the curveLoops of FootPrintRoof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ModelCurveArrArray GetProfiles()
Public Function GetProfiles As ModelCurveArrArray
public:
ModelCurveArrArray^ GetProfiles()
member GetProfiles : unit -> ModelCurveArrArray
Return Value
ModelCurveArrArray
See Also
Reference
FootPrintRoof Class
Autodesk.Revit.DB Namespace